
## Plan Result




<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.encoded[&#34;Ian-Test-64-only&#34;]
  * azurerm_key_vault_secret.encoded[&#34;Ian-Test-both&#34;]
  * azurerm_key_vault_secret.fixed_secrets[&#34;Ian-val&#34;]
  * azurerm_key_vault_secret.stored[&#34;Ian-Test-both&#34;]
  * azurerm_key_vault_secret.stored[&#34;Ian-Test-normal-only&#34;]
  * random_password.generated[&#34;Ian-Test-64-only&#34;]
  * random_password.generated[&#34;Ian-Test-both&#34;]
  * random_password.generated[&#34;Ian-Test-none&#34;]
  * random_password.generated[&#34;Ian-Test-normal-only&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.encoded["Ian-Test-64-only"] will be created
  + resource "azurerm_key_vault_secret" "encoded" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "Ian-Test-64-only-encoded"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.encoded["Ian-Test-both"] will be created
  + resource "azurerm_key_vault_secret" "encoded" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "Ian-Test-both-encoded"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.fixed_secrets["Ian-val"] will be created
  + resource "azurerm_key_vault_secret" "fixed_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "Ian-val"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored["Ian-Test-both"] will be created
  + resource "azurerm_key_vault_secret" "stored" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "Ian-Test-both"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored["Ian-Test-normal-only"] will be created
  + resource "azurerm_key_vault_secret" "stored" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "Ian-Test-normal-only"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # random_password.generated["Ian-Test-64-only"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["Ian-Test-both"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["Ian-Test-none"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["Ian-Test-normal-only"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"","Vars":{}} -->